RT-Thread/rt-thread/bsp/stm32f20x/Libraries/STM32F2xx_StdPeriph_Driver/src/stm32f2xx_dac.c
/**
  ******************************************************************************
  * @file    stm32f2xx_dac.c
  * @author  MCD Application Team
  * @version V1.0.0
  * @date    18-April-2011
   * @brief   This file provides firmware functions to manage the following
  *          functionalities of the Digital-to-Analog Converter (DAC) peripheral:
  *           - DAC channels configuration: trigger, output buffer, data format
  *           - DMA management
  *           - Interrupts and flags management
  *
  *  @verbatim
  *
  *          ===================================================================
  *                             DAC Peripheral features
  *          ===================================================================
  *
  *          DAC Channels
  *          =============
  *          The device integrates two 12-bit Digital Analog Converters that can
  *          be used independently or simultaneously (dual mode):
  *            1- DAC channel1 with DAC_OUT1 (PA4) as output
  *            1- DAC channel2 with DAC_OUT2 (PA5) as output
  *
  *          DAC Triggers
  *          =============
  *          Digital to Analog conversion can be non-triggered using DAC_Trigger_None
  *          and DAC_OUT1/DAC_OUT2 is available once writing to DHRx register
  *          using DAC_SetChannel1Data() / DAC_SetChannel2Data() functions.
  *
  *         Digital to Analog conversion can be triggered by:
  *             1- External event: EXTI Line 9 (any GPIOx_Pin9) using DAC_Trigger_Ext_IT9.
  *                The used pin (GPIOx_Pin9) must be configured in input mode.
  *
  *             2- Timers TRGO: TIM2, TIM4, TIM5, TIM6, TIM7 and TIM8
  *                (DAC_Trigger_T2_TRGO, DAC_Trigger_T4_TRGO...)
  *                The timer TRGO event should be selected using TIM_SelectOutputTrigger()
  *
  *             3- Software using DAC_Trigger_Software
  *
  *          DAC Buffer mode feature
  *          ========================
  *          Each DAC channel integrates an output buffer that can be used to
  *          reduce the output impedance, and to drive external loads directly
  *          without having to add an external operational amplifier.
  *          To enable, the output buffer use
  *              DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;
  *
  *          Refer to the device datasheet for more details about output
  *          impedance value with and without output buffer.
  *
  *          DAC wave generation feature
  *          =============================
  *          Both DAC channels can be used to generate
  *             1- Noise wave using DAC_WaveGeneration_Noise
  *             2- Triangle wave using DAC_WaveGeneration_Triangle
  *
  *          Wave generation can be disabled using DAC_WaveGeneration_None
  *
  *          DAC data format
  *          ================
  *          The DAC data format can be:
  *             1- 8-bit right alignment using DAC_Align_8b_R
  *             2- 12-bit left alignment using DAC_Align_12b_L
  *             3- 12-bit right alignment using DAC_Align_12b_R
  *
  *          DAC data value to voltage correspondence
  *          ========================================
  *          The analog output voltage on each DAC channel pin is determined
  *          by the following equation:
  *          DAC_OUTx = VREF+ * DOR / 4095
  *          with  DOR is the Data Output Register
  *                VEF+ is the input voltage reference (refer to the device datasheet)
  *          e.g. To set DAC_OUT1 to 0.7V, use
  *            DAC_SetChannel1Data(DAC_Align_12b_R, 868);
  *          Assuming that VREF+ = 3.3V, DAC_OUT1 = (3.3 * 868) / 4095 = 0.7V
  *
  *          DMA requests
  *          =============
  *          A DMA1 request can be generated when an external trigger (but not
  *          a software trigger) occurs if DMA1 requests are enabled using
  *          DAC_DMACmd()
  *          DMA1 requests are mapped as following:
  *             1- DAC channel1 : mapped on DMA1 Stream5 channel7 which must be
  *                               already configured
  *             2- DAC channel2 : mapped on DMA1 Stream6 channel7 which must be
  *                               already configured
  *
  *          ===================================================================
  *                              How to use this driver
  *          ===================================================================
  *            - DAC APB clock must be enabled to get write access to DAC
  *              registers using
  *              RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE)
  *            - Configure DAC_OUTx (DAC_OUT1: PA4, DAC_OUT2: PA5) in analog mode.
  *            - Configure the DAC channel using DAC_Init() function
  *            - Enable the DAC channel using DAC_Cmd() function
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************
  */


/* Includes ------------------------------------------------------------------*/
#include "stm32f2xx_dac.h"
#include "stm32f2xx_rcc.h"

/** @addtogroup STM32F2xx_StdPeriph_Driver
  * @{
  */

/** @defgroup DAC
  * @brief DAC driver modules
  * @{
  */

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

